multiSpeciesMassTransportLibrary/testCases/modifiedReactingFoam_mixing/0/Ydefault
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";


    class     	volScalarField;
    object 	Ydefault;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions [ 0 0 0 0 0 0 0 ];

internalField uniform 0;

// A.Alexiou 2015
boundaryField
{
    inletAir
    {
        type 		inletOutlet;
    	inletValue 	uniform 0;
    }
    inletFuel
    {
        type 		inletOutlet;
    	inletValue 	uniform 0;
    }
    outlet
    {
        type 		zeroGradient;
    }
    
    wallBetween
    {
        type            zeroGradient;
    }
    side
    {
        type            symmetryPlane;
	//type            symmetry;
    }
    down
    {
        type            symmetryPlane;
    }
    
    frontAndBackPlanes
    {
        type            empty;
    }


// ************************************************************************* //
